
[INDEX]
LANGUAGE=English
[UI]
~Xr_PreviewUI_GetView~=Get View
~Xr_PreviewUI_GetView_tooltip~=Get a view as the composition for generating preview.
~Xr_PreviewUI_Label_PreviewName~=Save Name：
~Xr_PreviewUI_UpDate~=UpDate
~Xr_PreviewUI_UpDate_tooltip~=Refresh default preview name and preview path.
~Xr_PreviewUI_Label_PreviewPath~=Save Path：
~Xr_PreviewUI_Browse~=Browse folder
~Xr_PreviewUI_Browse_tooltip~=Select the folder to save the preview file.
~Xr_PreviewUI_UseFileName~=Use File Name
~Xr_PreviewUI_UseFileName_tooltip~=Use the current file name to name the preview file.
~Xr_PreviewUI_UseFilePath~=Use File Path
~Xr_PreviewUI_UseFilePath_tooltip~=Use the current file path to store the preview file.
~Xr_PreviewUI_BatchPreview~=Batch Preview
~Xr_PreviewUI_BatchPreview_tooltip~=Generate a preview of all files in the folder where the current file is located.
~Xr_PreviewUI_AppStarting~=Background
~Xr_PreviewUI_AppStarting_tooltip~=Background generation preview.
~Xr_PreviewUI_Language_tooltip~=Language switching.
~Xr_PreviewUI_Setting~=Setting
~Xr_PreviewUI_Setting_tooltip~=Set Preview Configuration.
~Xr_PreviewUI_Run~=Run Preview
~Xr_PreviewUI_Run_tooltip~=Start generation preview.
~Xr_PreviewUI_Help~=Help

~Xr_PreviewUI_FileName~=Enter preview file name...
~Xr_PreviewUI_FilePath~=Please select browse path...
~Xr_PreviewUI_Browse_TextFile~=Xr：Select the folder to export

~Xr_PreviewUI_FFmpeg_messageBox~=Missing required (FFmpeg) encoder file！
~Xr_PreviewUI_GetPreviewName_messageBox~=Please enter the correct preview name！
~Xr_PreviewUI_GetPreviewPath_messageBox~=please enter a correct path！
~Xr_PreviewUI_SaveViewInt_messageBox~=Please select Get View first！
~Xr_PreviewUI_Error_messageBox~=An unknown error occurred！
~Xr_PreviewUI_RunPrint~=Xr: Press ESC several times to interrupt and cancel
~Xr_PreviewUI_BatchError_messageBox~=Batch preview run error！
~Xr_PreviewUI_OpenViewPath_querybox~=After generating preview, do you want to open the folder where the preview is located？
~Xr_PreviewUI_AppStarting_messageBox~=Background generation preview has been executed! Please wait for the completion of the prompt window!